Templates/houle/OpenFOAM_casefiles/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * Dimensions du canal * * * * * *
xmin 0.0;
xmax 26.0;
ymin -0.1;
ymax  0.0;
zmin 0.0;
zmax 2.0;
//************************************************

//* * * * * * * Propriétés du maillage * * * * * *
Nz %Nz%;
Nx #calc "std::floor($Nz * ($xmax - $xmin) / ($zmax - $zmin) )";
Ny 1;
//************************************************

vertices
( 
    ( $xmin $ymin $zmin ) //0
    ( $xmax $ymin $zmin ) //1
    ( $xmax $ymax $zmin ) //2
    ( $xmin $ymax $zmin ) //3

    ( $xmin $ymin $zmax ) //4
    ( $xmax $ymin $zmax ) //5
    ( $xmax $ymax $zmax ) //6
    ( $xmin $ymax $zmax ) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($Nx $Ny $Nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type empty;
        faces
        (
            (3 2 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
