Templates/houle/OpenFOAM_casefiles/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(

// * * * * * * Zone d'enrochements * * * * * * * * * *

/*
    {
 	name	porousCellSet;
	type	cellSet;
	action	new;
	source 	surfaceToCell;
	file    "constant/triSurface/actuel2_enrochements.stl";
	outsidePoints
    	(
	    (10.0 0.5 1.0)
        );

        includeCut	true;
        includeInside   true;
        includeOutside  false;
        nearDistance    -1;
        curvature	-100;
    }

    {
	name enrochements;
	type cellZoneSet;
	action new;
	source setToCellZone;
	sourceInfo
	{
	    set porousCellSet;
	}

    }

*/

// * * * * * * Zone du bac * * * * * * * * * *

    {
        name    bacCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (21.6 -2 -2) (22.0 2 2);
    }

    {
        name    bac;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     bacCellSet;
    }

);
